package C02;

public class C02음수 {

	public static void main(String[] args) {
		
		//컴퓨터(cpu)는 가산회로에 의해 덧셈처리를 할수 있다(0)
		//컴퓨터는 (cpu)는 뺄셈처리 할수 있다(x)
		//실제로 뺄셈의 결과를 가져오는 이유는 보수개념을 도입했기 때문이다.
		
		// 7-4 = 3
		// 7+6 = 3
		
		//75 -18 = 57
		//75 + 82 = 57
		
		//문제
		//음수값임을 고려하여 풉니다.
		//10 진수   -> 2진수
		//111 진수  -> 01101111
		//-111 진수 -> 10010001
		//96 진수   -> 01100000
		//-96 진수  -> 10100000
		//31 진수   -> 00011111
		//-31 진수  -> 11101001
		
		//2진수     -> 10진수
		//1010111  -> 170
		//00110101 -> 53
		//11001100 -> 204
		//10101010 -> 170
		
		
	}

}
